"""
Задание 1
Написать новую функцию и придумать 2–3 теста к ней
"""

def summa(a, b):
    return a + b


print(summa(1, 2))
#print(summa(3, 4))
#print(summa(5, 6))


